def cargo():
    text = (
        "При самовыкупе вы <b>САМОСТОЯТЕЛЬНО</b> покупаете товары у китайских поставщиков или на китайских "
        "маркетплейсах (1688, Made-In-China, taobao, pingduoduo и тд) и организуете доставку груза до склада карго "
        "в г Иу или  Гуанчжоу (на выбор)."
        "\n\nРешение ВСЕХ вопросов с продавцом (почему ваш товар еще не отправлен / еще не доехал /"
        "вернулся обратно к продавцу и тд) лежит полностью на вашей стороне."
        "\n\nСо своей стороны мы отвечаем только за доставку груза из Китая до РФ."
        "\n\n<b>Продолжаем?</b>"
    )
    return text
